In [13]:
import pandas as pd
df1 = pd.read_csv("data1.csv")
df2=pd.read_csv("data2.csv")

In [2]:
df1.head()

  name city  salary
0    A   NY    7872
1    B   LA    7716
2    C   CH    6096
3    E   BO    3000

In [3]:
df2.head()

  name city  age
0    A   NY   25
1    B   LA   30
2    C   CH   22
3    D   BO   34

In [8]:
df3=df1.merge(df2,on='name', how="inner",suffixes=("_data1","_data2"))
df3.head()

  name city_data1  salary city_data2  age
0    A         NY    7872         NY   25
1    B         LA    7716         LA   30
2    C         CH    6096         CH   22

In [14]:
df4=df1.merge(df2,on='city', how="left")
df4.head()

  name_x city  salary name_y  age
0      A   NY    7872      A   25
1      B   LA    7716      B   30
2      C   CH    6096      C   22
3      E   BO    3000      D   34

In [18]:
df11=pd.DataFrame({
    "A":[1,2,3,4],
    "B":[5,6,7,8]
})

df22=pd.DataFrame({
    "C":[11,12],
    "D":[15,16]
})

df33=df11.join(df22)
df33.head()

   A  B     C     D
0  1  5  11.0  15.0
1  2  6  12.0  16.0
2  3  7   NaN   NaN
3  4  8   NaN   NaN

In [24]:
df11=pd.DataFrame({
    "A":[1,2,3,4],
    "B":[5,6,7,8]
},index=['a','b','c','d'])

df22=pd.DataFrame({
    "C":[11,12],
    "D":[15,16]
},index=['a','b'])

df33=df11.join(df22, how='outer')
df33.head()

   A  B     C     D
a  1  5  11.0  15.0
b  2  6  12.0  16.0
c  3  7   NaN   NaN
d  4  8   NaN   NaN

# Reshaping Functions in Pandas

## 1. melt() - Wide to Long Format
Transforms wide format data into long format by unpivoting columns into rows.

In [3]:
import pandas as pd
# Create sample data
df_wide = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 92, 78],
    'Science': [88, 95, 82],
    'English': [90, 87, 85]
})

print("Original Wide Format:")
print(df_wide)
print("\n" + "="*50 + "\n")

# Using melt() to convert to long format
df_melted = df_wide.melt(id_vars=['Student'], 
                          var_name='Subject', 
                          value_name='Score')

print("After melt() - Long Format:")
print(df_melted)

Original Wide Format:
   Student  Math  Science  English
0    Alice    85       88       90
1      Bob    92       95       87
2  Charlie    78       82       85

==================================================

After melt() - Long Format:
   Student  Subject  Score
0    Alice     Math     85
1      Bob     Math     92
2  Charlie     Math     78
3    Alice  Science     88
4      Bob  Science     95
5  Charlie  Science     82
6    Alice  English     90
7      Bob  English     87
8  Charlie  English     85

## 2. pivot() - Long to Wide Format
Reshapes data based on column values, creating a new table with unique index/column combinations.

In [4]:
# Create sample long format data
df_long = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'City': ['New York', 'London', 'New York', 'London'],
    'Temperature': [32, 45, 35, 48]
})

print("Original Long Format:")
print(df_long)
print("\n" + "="*50 + "\n")

# Using pivot() to convert to wide format
df_pivoted = df_long.pivot(index='Date', columns='City', values='Temperature')

print("After pivot() - Wide Format:")
print(df_pivoted)

Original Long Format:
         Date      City  Temperature
0  2024-01-01  New York           32
1  2024-01-01    London           45
2  2024-01-02  New York           35
3  2024-01-02    London           48

==================================================

After pivot() - Wide Format:
City        London  New York
Date
2024-01-01      45        32
2024-01-02      48        35

## 3. pivot_table() - Aggregation with Pivoting
Similar to pivot() but can handle duplicate entries by aggregating values.

In [5]:
# Create sample data with duplicates
df_sales = pd.DataFrame({
    'Date': ['2024-01', '2024-01', '2024-01', '2024-02', '2024-02', '2024-02'],
    'Product': ['Laptop', 'Phone', 'Laptop', 'Laptop', 'Phone', 'Tablet'],
    'Region': ['East', 'East', 'West', 'East', 'West', 'East'],
    'Sales': [1000, 500, 1200, 1100, 600, 300]
})

print("Original Data:")
print(df_sales)
print("\n" + "="*50 + "\n")

# Using pivot_table() with aggregation (mean by default)
df_pivot_table = df_sales.pivot_table(
    index='Product', 
    columns='Region', 
    values='Sales', 
    aggfunc='sum',
    fill_value=0
)

print("After pivot_table() - Aggregated Sales by Product and Region:")
print(df_pivot_table)

Original Data:
      Date Product Region  Sales
0  2024-01  Laptop   East   1000
1  2024-01   Phone   East    500
2  2024-01  Laptop   West   1200
3  2024-02  Laptop   East   1100
4  2024-02   Phone   West    600
5  2024-02  Tablet   East    300

==================================================

After pivot_table() - Aggregated Sales by Product and Region:
Region   East  West
Product
Laptop   2100  1200
Phone     500   600
Tablet    300     0

## 4. stack() - Columns to Rows (Pivoting innermost level)
Converts column labels into row index levels, creating a multi-index Series.

In [6]:
# Create sample DataFrame
df_multi = pd.DataFrame({
    'Q1': [100, 150, 200],
    'Q2': [110, 160, 210],
    'Q3': [120, 170, 220]
}, index=['Product A', 'Product B', 'Product C'])

print("Original DataFrame:")
print(df_multi)
print("\n" + "="*50 + "\n")

# Using stack() to pivot columns to rows
df_stacked = df_multi.stack()

print("After stack() - Columns became row index:")
print(df_stacked)
print("\nType:", type(df_stacked))

Original DataFrame:
            Q1   Q2   Q3
Product A  100  110  120
Product B  150  160  170
Product C  200  210  220

==================================================

After stack() - Columns became row index:
Product A  Q1    100
           Q2    110
           Q3    120
Product B  Q1    150
           Q2    160
           Q3    170
Product C  Q1    200
           Q2    210
           Q3    220
dtype: int64

Type: <class 'pandas.core.series.Series'>

## 5. unstack() - Rows to Columns (Unpivoting innermost level)
Converts row index levels into columns, opposite of stack().

In [7]:
# Create multi-index Series (like the stacked result)
index = pd.MultiIndex.from_tuples([
    ('Product A', 'Q1'), ('Product A', 'Q2'),
    ('Product B', 'Q1'), ('Product B', 'Q2'),
    ('Product C', 'Q1'), ('Product C', 'Q2')
])
series_stacked = pd.Series([100, 110, 150, 160, 200, 210], index=index)

print("Stacked Data (Series with MultiIndex):")
print(series_stacked)
print("\n" + "="*50 + "\n")

# Using unstack() to convert back to DataFrame
df_unstacked = series_stacked.unstack()

print("After unstack() - Row index became columns:")
print(df_unstacked)

# You can also unstack different levels
print("\n" + "="*50 + "\n")
print("Unstacking level 0 (Products to columns):")
print(series_stacked.unstack(level=0))

Stacked Data (Series with MultiIndex):
Product A  Q1    100
           Q2    110
Product B  Q1    150
           Q2    160
Product C  Q1    200
           Q2    210
dtype: int64

==================================================

After unstack() - Row index became columns:
            Q1   Q2
Product A  100  110
Product B  150  160
Product C  200  210

==================================================

Unstacking level 0 (Products to columns):
    Product A  Product B  Product C
Q1        100        150        200
Q2        110        160        210

## Summary Comparison

In [8]:
print("""
RESHAPING FUNCTIONS SUMMARY:
============================

1. melt(): Wide → Long
   - Unpivots DataFrame (columns → rows)
   - Use: When you have multiple value columns to combine into one
   
2. pivot(): Long → Wide  
   - Reshapes based on index/column values
   - Use: When you need to spread values across columns
   - Note: Doesn't handle duplicates
   
3. pivot_table(): Long → Wide with Aggregation
   - Like pivot() but with aggregation functions
   - Use: When you have duplicate entries that need aggregation
   - Supports: sum, mean, count, min, max, etc.
   
4. stack(): Columns → Rows
   - Pivots columns into row index (creates MultiIndex)
   - Returns: Series or DataFrame with MultiIndex
   - Use: Compress columns into index levels
   
5. unstack(): Rows → Columns
   - Pivots row index into columns (opposite of stack)
   - Returns: DataFrame with pivoted columns
   - Use: Expand index levels into columns
""")

RESHAPING FUNCTIONS SUMMARY:
============================

1. melt(): Wide → Long
   - Unpivots DataFrame (columns → rows)
   - Use: When you have multiple value columns to combine into one

2. pivot(): Long → Wide
   - Reshapes based on index/column values
   - Use: When you need to spread values across columns
   - Note: Doesn't handle duplicates

3. pivot_table(): Long → Wide with Aggregation
   - Like pivot() but with aggregation functions
   - Use: When you have duplicate entries that need aggregation
   - Supports: sum, mean, count, min, max, etc.

4. stack(): Columns → Rows
   - Pivots columns into row index (creates MultiIndex)
   - Returns: Series or DataFrame with MultiIndex
   - Use: Compress columns into index levels

5. unstack(): Rows → Columns
   - Pivots row index into columns (opposite of stack)
   - Returns: DataFrame with pivoted columns
   - Use: Expand index levels into columns